In [1]:
import numpy as np
import pandas as pd

import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
get_ipython().magic('matplotlib inline')
sns.set(style = 'white', font_scale = 0.9)

In [3]:
dataset = pd.read_csv('loan.csv')

dataset.head()

C:\Users\LUY1\AppData\Local\Continuum\anaconda3\lib\site-packages\IPython\core\interactiveshell.py:2785: DtypeWarning: Columns (19,55) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

,id,member_id,loan_amnt,funded_amnt,funded_amnt_inv,term,int_rate,installment,grade,sub_grade,...,total_bal_il,il_util,open_rv_12m,open_rv_24m,max_bal_bc,all_util,total_rev_hi_lim,inq_fi,total_cu_tl,inq_last_12m
0,1077501,1296599,5000.0,5000.0,4975.0,36 months,10.65,162.87,B,B2,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,1077430,1314167,2500.0,2500.0,2500.0,60 months,15.27,59.83,C,C4,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,1077175,1313524,2400.0,2400.0,2400.0,36 months,15.96,84.33,C,C5,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,1076863,1277178,10000.0,10000.0,10000.0,36 months,13.49,339.31,C,C1,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,1075358,1311748,3000.0,3000.0,3000.0,60 months,12.69,67.79,B,B5,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [4]:
dataset.columns.values

array(['id', 'member_id', 'loan_amnt', 'funded_amnt', 'funded_amnt_inv',
       'term', 'int_rate', 'installment', 'grade', 'sub_grade',
       'emp_title', 'emp_length', 'home_ownership', 'annual_inc',
       'verification_status', 'issue_d', 'loan_status', 'pymnt_plan',
       'url', 'desc', 'purpose', 'title', 'zip_code', 'addr_state', 'dti',
       'delinq_2yrs', 'earliest_cr_line', 'inq_last_6mths',
       'mths_since_last_delinq', 'mths_since_last_record', 'open_acc',
       'pub_rec', 'revol_bal', 'revol_util', 'total_acc',
       'initial_list_status', 'out_prncp', 'out_prncp_inv', 'total_pymnt',
       'total_pymnt_inv', 'total_rec_prncp', 'total_rec_int',
       'total_rec_late_fee', 'recoveries', 'collection_recovery_fee',
       'last_pymnt_d', 'last_pymnt_amnt', 'next_pymnt_d',
       'last_credit_pull_d', 'collections_12_mths_ex_med',
       'mths_since_last_major_derog', 'policy_code', 'application_type',
       'annual_inc_joint', 'dti_joint', 'verification_status_joint',
       'acc_now_delinq', 'tot_coll_amt', 'tot_cur_bal', 'open_acc_6m',
       'open_il_6m', 'open_il_12m', 'open_il_24m', 'mths_since_rcnt_il',
       'total_bal_il', 'il_util', 'open_rv_12m', 'open_rv_24m',
       'max_bal_bc', 'all_util', 'total_rev_hi_lim', 'inq_fi',
       'total_cu_tl', 'inq_last_12m'], dtype=object)

In [5]:
# Pre-processing data

In [6]:
dataset['verification_status_joint'].fillna(dataset['verification_status'], inplace = True)

In [7]:
dataset['verification_status'].head()

0           Verified
1    Source Verified
2       Not Verified
3    Source Verified
4    Source Verified
Name: verification_status, dtype: object

In [8]:
strColumns = dataset.select_dtypes(include = ['object']).columns.values

strColumns

array(['term', 'grade', 'sub_grade', 'emp_title', 'emp_length',
       'home_ownership', 'verification_status', 'issue_d', 'loan_status',
       'pymnt_plan', 'url', 'desc', 'purpose', 'title', 'zip_code',
       'addr_state', 'earliest_cr_line', 'initial_list_status',
       'last_pymnt_d', 'next_pymnt_d', 'last_credit_pull_d',
       'application_type', 'verification_status_joint'], dtype=object)

In [9]:
dataset['annual_inc_joint'].fillna(dataset['annual_inc'], inplace = True)

dataset['dti_joint'].fillna(dataset['dti'], inplace = True)

In [10]:
strColumns = dataset.select_dtypes(include = [np.number]).columns.values

strColumns

array(['id', 'member_id', 'loan_amnt', 'funded_amnt', 'funded_amnt_inv',
       'int_rate', 'installment', 'annual_inc', 'dti', 'delinq_2yrs',
       'inq_last_6mths', 'mths_since_last_delinq',
       'mths_since_last_record', 'open_acc', 'pub_rec', 'revol_bal',
       'revol_util', 'total_acc', 'out_prncp', 'out_prncp_inv',
       'total_pymnt', 'total_pymnt_inv', 'total_rec_prncp',
       'total_rec_int', 'total_rec_late_fee', 'recoveries',
       'collection_recovery_fee', 'last_pymnt_amnt',
       'collections_12_mths_ex_med', 'mths_since_last_major_derog',
       'policy_code', 'annual_inc_joint', 'dti_joint', 'acc_now_delinq',
       'tot_coll_amt', 'tot_cur_bal', 'open_acc_6m', 'open_il_6m',
       'open_il_12m', 'open_il_24m', 'mths_since_rcnt_il', 'total_bal_il',
       'il_util', 'open_rv_12m', 'open_rv_24m', 'max_bal_bc', 'all_util',
       'total_rev_hi_lim', 'inq_fi', 'total_cu_tl', 'inq_last_12m'],
      dtype=object)

In [12]:
dataset[strColumns] = dataset[strColumns].fillna(dataset[strColumns].mean())

In [13]:
dataset = dataset[~dataset['loan_status'].isin(['Issued', 
                                                'Does not meet the credit policy. Status:Fully Paid',
                                                'Does not meet the credit policy. Status:Charged Off'])]
dataset.head()

,id,member_id,loan_amnt,funded_amnt,funded_amnt_inv,term,int_rate,installment,grade,sub_grade,...,total_bal_il,il_util,open_rv_12m,open_rv_24m,max_bal_bc,all_util,total_rev_hi_lim,inq_fi,total_cu_tl,inq_last_12m
0,1077501,1296599,5000.0,5000.0,4975.0,36 months,10.65,162.87,B,B2,...,36552.811389,71.535317,1.38906,2.975482,5887.97974,60.831939,32068.620045,0.943945,1.537058,1.977307
1,1077430,1314167,2500.0,2500.0,2500.0,60 months,15.27,59.83,C,C4,...,36552.811389,71.535317,1.38906,2.975482,5887.97974,60.831939,32068.620045,0.943945,1.537058,1.977307
2,1077175,1313524,2400.0,2400.0,2400.0,36 months,15.96,84.33,C,C5,...,36552.811389,71.535317,1.38906,2.975482,5887.97974,60.831939,32068.620045,0.943945,1.537058,1.977307
3,1076863,1277178,10000.0,10000.0,10000.0,36 months,13.49,339.31,C,C1,...,36552.811389,71.535317,1.38906,2.975482,5887.97974,60.831939,32068.620045,0.943945,1.537058,1.977307
4,1075358,1311748,3000.0,3000.0,3000.0,60 months,12.69,67.79,B,B5,...,36552.811389,71.535317,1.38906,2.975482,5887.97974,60.831939,32068.620045,0.943945,1.537058,1.977307

In [14]:
def CreateDefault(Loan_Status):
    if Loan_Status in ['Current', 'Fully Paid', 'In Grace Period']:
        return 0
    else:
        return 1

In [15]:
dataset['Default'] = dataset['loan_status'].apply(lambda x: CreateDefault(x))

In [60]:
def EmpLength(emp_len):
    if pd.isnull(emp_len):
        return emp_len
    elif emp_len[:2] == '10':
        return 10
    elif emp_len[:1] in ['<', 'n']:
        return 0
    else:
        return int(emp_len[:1])

In [62]:
dataset['emp_length'].apply(lambda x: EmpLength(x)).head()

0    10.0
1     0.0
2    10.0
3    10.0
4     1.0
Name: emp_length, dtype: float64

In [63]:
dataset['Emp_Length_Years'] = dataset['emp_length'].apply(lambda x: EmpLength(x))

In [37]:
dataset['emp_length'][1]

'< 1 year'

In [38]:
dataset['emp_length'][1][:2]

'< '

In [39]:
dataset['emp_length'][10][:2]

'5 '

In [40]:
dataset['emp_length'].head()

0    10+ years
1     < 1 year
2    10+ years
3    10+ years
4       1 year
Name: emp_length, dtype: object

In [44]:
dataset['emp_length'][0][:2]

'10'

In [59]:
dataset['emp_length'].apply(lambda x: x if pd.isnull(x) else x[:2])

0          10
1          <
2          10
3          10
4          1
5          3
6          8
7          9
8          4
9          <
10         5
11         10
12         <
13         3
14         3
15         <
16         4
17         10
18         1
19         6
20         3
21         10
22         10
23         5
24         1
25         2
26         9
27         2
28         10
29         <
         ...
887349     2
887350     10
887351     10
887352     <
887353     4
887354     10
887355    NaN
887356     10
887357     10
887358     3
887359    NaN
887360     10
887361     10
887362     9
887363     4
887364     <
887365     10
887366     2
887367     1
887368     8
887369     10
887370     8
887371    NaN
887372     <
887373     10
887374     8
887375     10
887376     5
887377     1
887378     10
Name: emp_length, Length: 876170, dtype: object

In [54]:
dataset['emp_length'].isnull().sum()

44160

In [55]:
dataset.shape

(876170, 75)

In [64]:
dataset['Earliest_Cr_Line_Yr'] = pd.to_numeric(dataset['earliest_cr_line'].str[-4:],
                                              errors = 'coerce').round(0)

dataset['Earliest_Cr_Line_Yr'] = dataset['Earliest_Cr_Line_Yr'].fillna(int(dataset['Earliest_Cr_Line_Yr'].mean()))

In [65]:
dataset_d = dataset[dataset['Default'] == 1].sample(n = 1000, replace = False, random_state = 0)

dataset_nd = dataset[dataset['Default'] == 0].sample(n = 2000, replace = False, random_state = 0)

In [66]:
dataset = dataset_d

dataset = dataset.append(dataset_nd)

In [67]:
dataset.shape

(3000, 77)

In [68]:
X = dataset[['loan_amnt', 'term', 'int_rate', 'grade', 'home_ownership', 'annual_inc',
            'verification_status', 'dti', 'purpose', 'application_type', 'Emp_Length_Years', 'Earliest_Cr_Line_Yr']]

y = dataset['Default']

In [69]:
X.head()

,loan_amnt,term,int_rate,grade,home_ownership,annual_inc,verification_status,dti,purpose,application_type,Emp_Length_Years,Earliest_Cr_Line_Yr
400246,5225.0,36 months,11.99,B,OWN,17627.0,Verified,29.84,credit_card,INDIVIDUAL,NaN,1994
223922,10000.0,36 months,13.11,B,RENT,40400.0,Source Verified,18.42,credit_card,INDIVIDUAL,2.0,2004
361504,6000.0,36 months,22.15,E,RENT,72000.0,Source Verified,15.83,debt_consolidation,INDIVIDUAL,4.0,1993
261157,5000.0,36 months,18.54,E,RENT,28000.0,Not Verified,16.80,debt_consolidation,INDIVIDUAL,0.0,1959
808762,19475.0,60 months,23.99,F,RENT,55000.0,Verified,34.98,debt_consolidation,INDIVIDUAL,9.0,1989

In [70]:
y[:5]

400246    1
223922    1
361504    1
261157    1
808762    1
Name: Default, dtype: int64

In [72]:
df_mod  = pd.concat([X, y], axis = 1)

df_mod.head()

,loan_amnt,term,int_rate,grade,home_ownership,annual_inc,verification_status,dti,purpose,application_type,Emp_Length_Years,Earliest_Cr_Line_Yr,Default
400246,5225.0,36 months,11.99,B,OWN,17627.0,Verified,29.84,credit_card,INDIVIDUAL,NaN,1994,1
223922,10000.0,36 months,13.11,B,RENT,40400.0,Source Verified,18.42,credit_card,INDIVIDUAL,2.0,2004,1
361504,6000.0,36 months,22.15,E,RENT,72000.0,Source Verified,15.83,debt_consolidation,INDIVIDUAL,4.0,1993,1
261157,5000.0,36 months,18.54,E,RENT,28000.0,Not Verified,16.80,debt_consolidation,INDIVIDUAL,0.0,1959,1
808762,19475.0,60 months,23.99,F,RENT,55000.0,Verified,34.98,debt_consolidation,INDIVIDUAL,9.0,1989,1

In [73]:
df_mod.to_pickle('df_mod_cat.pkl')

In [74]:
df_mod.isnull().sum()/df_mod.shape[0]

loan_amnt              0.000000
term                   0.000000
int_rate               0.000000
grade                  0.000000
home_ownership         0.000000
annual_inc             0.000000
verification_status    0.000000
dti                    0.000000
purpose                0.000000
application_type       0.000000
Emp_Length_Years       0.054333
Earliest_Cr_Line_Yr    0.000000
Default                0.000000
dtype: float64

In [76]:
df_mod['Emp_Length_Years'].median()

6.0

In [77]:
df_mod['Emp_Length_Years'].fillna(df_mod['Emp_Length_Years'].median(), inplace = True)

In [78]:
df_mod.to_pickle('df_mod_cat_2.pkl')

In [81]:
df_num = df_mod.select_dtypes(exclude = ['object'])

df_num.head()

,loan_amnt,int_rate,annual_inc,dti,Emp_Length_Years,Earliest_Cr_Line_Yr,Default
400246,5225.0,11.99,17627.0,29.84,6.0,1994,1
223922,10000.0,13.11,40400.0,18.42,2.0,2004,1
361504,6000.0,22.15,72000.0,15.83,4.0,1993,1
261157,5000.0,18.54,28000.0,16.80,0.0,1959,1
808762,19475.0,23.99,55000.0,34.98,9.0,1989,1

In [82]:
df_cat = df_mod.select_dtypes(include = ['object'])

df_cat.head()

,term,grade,home_ownership,verification_status,purpose,application_type
400246,36 months,B,OWN,Verified,credit_card,INDIVIDUAL
223922,36 months,B,RENT,Source Verified,credit_card,INDIVIDUAL
361504,36 months,E,RENT,Source Verified,debt_consolidation,INDIVIDUAL
261157,36 months,E,RENT,Not Verified,debt_consolidation,INDIVIDUAL
808762,60 months,F,RENT,Verified,debt_consolidation,INDIVIDUAL

In [85]:
from sklearn.preprocessing import LabelEncoder

le = LabelEncoder()

df_cat_tonum = df_cat.apply(lambda x: le.fit_transform(x))
df_cat_tonum.head()

,term,grade,home_ownership,verification_status,purpose,application_type
400246,0,1,2,2,1,0
223922,0,1,3,1,1,0
361504,0,4,3,1,2,0
261157,0,4,3,0,2,0
808762,1,5,3,2,2,0

In [86]:
df_mod_3 = pd.concat([df_cat_tonum, df_num], axis = 1)

df_mod_3.head()

,term,grade,home_ownership,verification_status,purpose,application_type,loan_amnt,int_rate,annual_inc,dti,Emp_Length_Years,Earliest_Cr_Line_Yr,Default
400246,0,1,2,2,1,0,5225.0,11.99,17627.0,29.84,6.0,1994,1
223922,0,1,3,1,1,0,10000.0,13.11,40400.0,18.42,2.0,2004,1
361504,0,4,3,1,2,0,6000.0,22.15,72000.0,15.83,4.0,1993,1
261157,0,4,3,0,2,0,5000.0,18.54,28000.0,16.80,0.0,1959,1
808762,1,5,3,2,2,0,19475.0,23.99,55000.0,34.98,9.0,1989,1

In [87]:
df_mod_3.to_pickle('df_mod_3.pkl')

In [88]:
df_mod_3.isnull().sum()/df_mod_3.shape[0]

term                   0.0
grade                  0.0
home_ownership         0.0
verification_status    0.0
purpose                0.0
application_type       0.0
loan_amnt              0.0
int_rate               0.0
annual_inc             0.0
dti                    0.0
Emp_Length_Years       0.0
Earliest_Cr_Line_Yr    0.0
Default                0.0
dtype: float64